---
title: Cisco Packet Tracer
date: 2025-04-17T10:20:02+08:00
lastmod: 2025-04-17T10:20:02+08:00
author: Author Name
# avatar: /img/author.jpg
# authorlink: https://author.site
cover: https://hackmd.io/_uploads/BJZ0UyRCyl.png
# images:
#   - /img/cover.jpg
categories:
  - ç¶²è·¯
tags:
  - Network
# nolastmod: true
draft: true
---

ç¶²è·¯æ‡‰ç”¨èˆ‡å¯¦å‹™çš„èª²ç¨‹å…§å®¹ï¼Œé€™è£¡ç´€éŒ„å¤§éƒ¨åˆ†å¸¸ç”¨åˆ°çš„æŒ‡ä»¤ï¼Œä¸¦ä¸”æ•´ç†ä¸€äº›æ¯”è¼ƒåŸºæœ¬çš„æ¦‚å¿µ

<!--more-->

## ğŸ”¹ å±¤ç´šæ¦‚å¿µç°¡ä»‹

- `Switch>`ï¼šä½¿ç”¨è€…æ¨¡å¼ (User EXEC Mode) â€” å¯æŸ¥çœ‹åŸºæœ¬è³‡è¨Šã€‚
- `Switch#`ï¼šç‰¹æ¬Šæ¨¡å¼ (Privileged EXEC Mode) â€” å¯åŸ·è¡Œè¨­å®šèˆ‡æŸ¥çœ‹ç³»çµ±ç‹€æ…‹ã€‚
- `Switch(config)#`ï¼šå…¨åŸŸè¨­å®šæ¨¡å¼ (Global Configuration Mode) â€” é€²è¡Œç³»çµ±å±¤ç´šè¨­å®šã€‚
- `Switch(config-line)#`ï¼šè¡Œè¨­å®šæ¨¡å¼ (Line Configuration Mode) â€” è¨­å®š consoleã€VTY ç­‰å­˜å–ç«¯å£ã€‚
- `Switch(config-if)#`ï¼šä»‹é¢è¨­å®šæ¨¡å¼ â€” è¨­å®šå€‹åˆ¥åŸ çš„ç›¸é—œåƒæ•¸ã€‚

---

### 1. é€²å…¥ç‰¹æ¬Šæ¨¡å¼

```bash
Switch> enable
```
ğŸ‘‰ é€²å…¥ç‰¹æ¬Šæ¨¡å¼ï¼Œé–‹å§‹é€²è¡Œç³»çµ±è¨­å®šã€‚

---

### 2. æŸ¥çœ‹ç›®å‰åŸ·è¡Œè¨­å®š

```bash
Switch# show running-config
```
ğŸ‘‰ é¡¯ç¤ºç›®å‰è¨˜æ†¶é«”ä¸­è¼‰å…¥çš„è¨­å®šã€‚

---

### 3. é€²å…¥å…¨åŸŸè¨­å®šæ¨¡å¼

```bash
Switch# configure terminal
```
ğŸ‘‰ é€²å…¥è¨­å®šæ¨¡å¼ï¼Œæº–å‚™ä¿®æ”¹è¨­å‚™åƒæ•¸ã€‚

---

### 4. è¨­å®šä¸»æ©Ÿåç¨±

```bash
Switch(config)# hostname S1
```
ğŸ‘‰ è¨­å®šè¨­å‚™åç¨±ç‚º S1ã€‚

---

### 5. é€²å…¥ Console è¨­å®šæ¨¡å¼

```bash
Switch(config)# line console 0
```
ğŸ‘‰ é€²å…¥ console line è¨­å®šç‹€æ…‹ã€‚

---

### 6. è¨­å®š Console å¯†ç¢¼

```bash
Switch(config-line)# password <å¯†ç¢¼>
```
ğŸ‘‰ æŒ‡å®š console å¯†ç¢¼ç‚º <å¯†ç¢¼>ã€‚

---

### 7. å•Ÿç”¨ Console å¯†ç¢¼é©—è­‰

```bash
Switch(config-line)# login
```
ğŸ‘‰ é–‹å•Ÿå¯†ç¢¼æª¢æŸ¥ï¼Œä½¿ç”¨è€…ç™»å…¥æ™‚éœ€è¼¸å…¥å¯†ç¢¼ã€‚

---

### 8. è¨­å®š enable å¯†ç¢¼ï¼ˆæ˜ç¢¼ï¼‰

```bash
Switch(config)# enable password <å¯†ç¢¼>
```
ğŸ‘‰ ç‚ºç‰¹æ¬Šæ¨¡å¼è¨­å®šæ˜ç¢¼å¯†ç¢¼ã€‚

---

### 9. è¨­å®š enable å¯†ç¢¼ï¼ˆåŠ å¯†ï¼‰

```bash
Switch(config)# enable secret <å¯†ç¢¼>
```
ğŸ‘‰ åŠ å¯†ç‰ˆæœ¬çš„ enable å¯†ç¢¼ï¼Œå®‰å…¨æ€§æ›´é«˜ã€‚

---

### 10. åŠ å¯†æ‰€æœ‰æ˜ç¢¼å¯†ç¢¼

```bash
Switch(config)# service password-encryption
```
ğŸ‘‰ å°‡æ‰€æœ‰æ˜ç¢¼å¯†ç¢¼åŠ å¯†é¡¯ç¤ºã€‚

---

### 11. è¨­å®š MOTD è­¦å‘Šæ©«å¹…

```bash
Switch(config)# banner motd "This is a secure system. Authorized Access Only!"
```
ğŸ‘‰ é¡¯ç¤ºç™»å…¥è­¦å‘Šè¨Šæ¯ã€‚

---

### 12. å„²å­˜è¨­å®šåˆ° NVRAM

```bash
Switch# copy running-config startup-config
```
ğŸ‘‰ å°‡ç›®å‰è¨­å®šå„²å­˜æˆé–‹æ©Ÿè¨­å®šã€‚

---

### 13. æŸ¥çœ‹ NVRAM è¨­å®š

```bash
Switch# show startup-config
```
ğŸ‘‰ é¡¯ç¤ºé–‹æ©Ÿæ™‚æ‰€ä½¿ç”¨çš„è¨­å®šå…§å®¹ã€‚

---

## ğŸ“Œ é™„è¨»

- `enable secret` æ¯” `enable password` æ›´å®‰å…¨ï¼Œæœƒè‡ªå‹•åŠ å¯†ã€‚
- `service password-encryption` æ˜¯é‡å°æ‰€æœ‰æœªåŠ å¯†å¯†ç¢¼å•Ÿç”¨åŠ å¯†æ©Ÿåˆ¶ã€‚
- æ‰€æœ‰è¨­å®šéƒ½æ‡‰å„²å­˜è‡³ startup-config ä»¥é¿å…é–‹æ©Ÿéºå¤±ã€‚